#现有一个包含N个元素的元组或者序列，怎么样将它里面的值解压后同时赋值给N个变量
#任何的序列（或是迭代对象）可以通过赋值解压并且赋值，前提是变量数量必须与序列数量一样
>>>p = (4,5)
>>>x,y = p
>>>x
4
>>>y
5
>>>
>>>data=['acme',50,91.1,(2012,12,21)]
>>>name,shares,price,date=data
>>>name
'acme'
>>>date
(2012,12,21)
>>>name,shares,price,(year,mon,day)=data
>>>year
2012
>>>day
21
>>>

#如果变量个数和序列元素个数不匹配，会产生一个异常
>>>p=(4,5)
>>>x,y,z=p
#报错ValueError

#这种解压赋值可以用在任何可迭代对象上面，包括列表，元组，字符串，文件对象，迭代器和生成器
>>>s='hello'
>>>a,b,c,d,e=s
>>>a
'h'
>>>e
'o'
>>>

#如果只想解压一部分，丢弃其他值，可以用任意变量名去占位
>>>data=['acme',50,91.1,(2012,12,21)]
>>>_,shares,price,_ =data
>>>shares
50
>>>price
91.1
